<a href="https://colab.research.google.com/github/HeileyP/Kaggle/blob/main/iris.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<img src='https://ifh.cc/g/fx7Kp2.png' width="800px;" border='0'>

# **🔥Scikit-Learn: 파이썬 기계학습 라이브러리**

<img src='https://ifh.cc/g/VfqO4P.jpg' border='0'>

# ⛳ **무엇을 배우나요?** 〰 Scikit Learn 💻📖🔍

<img src='https://ifh.cc/g/at7WCv.jpg' width="1000px;" border='0'>

## **개요**

<img src='https://ifh.cc/g/vZbaJH.png' width="250px;" border='0'>

</br>  

싸이킷런은 파이썬 기반 범용 오픈 소스 라이브러리(툴)로서,  
다양한 기계학습 알고리즘 적용(데이터 분석)을 위한 기능들을 포함하고 있습니다.

</br>
</br>

**🧐 scikit-learn 홈페이지에 들어가서 얼마나 다양한 것들을 할 수 있는지 둘러볼까요?**

👉 https://scikit-learn.org/stable/

</br>
</br>

<img src='https://ifh.cc/g/SR7Gyb.png' border='0'>

</br>

<img src='https://ifh.cc/g/IGvnbQ.jpg' border='0'>

##💬 **scikit-learn 머신러닝(지도학습)을 위해 꼭 필요한 3가지 조건**

우리는 머신러닝에서 주로 **지도학습**, 즉 **supervised learning** 을 다룰 겁니다.  
그러기 위해 필요한 3가지는  

📌Step1. [feature1, feature 2 ...... , target] 에서 n개의 feature(X) 와 1개의 target(Y) 분리  

📌Step2. 데이터 인코딩 (*모든 입/출력값은 '숫자' 로 되어있어야 한다!)  

📌Step3. test set과 train set 분리

<img src='https://ifh.cc/g/IGvnbQ.jpg' border='0'>

### 📌 **Step1. Feature(X) 와 Target(Y) 분리**

머신러닝 지도학습은 feature(X) 값들을 사용하여 target(Y) 값을 예측하도록 학습합니다.  
만약 데이터의 **어떤 부분이 feature 이고 어떤 부분이 target 인지** 명확하게 구분을 해놓지 않는다면 학습이 안되겠죠?

<img src = "https://1.bp.blogspot.com/-T26D5I27FkA/XoF9dMBin7I/AAAAAAAAAOY/Gao09-IsQkcjlUdNIcb8aJEDdNG3pQY2QCLcBGAsYHQ/s1600/%25E1%2584%258F%25E1%2585%25A2%25E1%2586%25B8%25E1%2584%258E%25E1%2585%25A51.JPG" width = "800">

In [ ]:
import seaborn as sns



---


> 아래의 titanic_dataset을 살펴보고 어떤 열(column)이 feature(X)이고 target(Y)이 될까요?  
> 👋 손들고 답을 말해볼까요?
> ```
>```

In [ ]:
titanic = sns.load_dataset('titanic')
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

</br>

<img src='https://ifh.cc/g/B2hVe7.png' width="330px;" height="70px;" border='0'>

🔍 아래 mpg_dataset 에서도 한 번 feature와 target을 구분해볼까요? 

<img src='https://ifh.cc/g/4Me4qI.jpg' width="400px;" height="300px;" border='0'>

> **mpg 데이터셋 설명**
- mpg(miles per gallon) = 연비  
- cylinders = 실린더 개수   
- displacement = 배기량  
- horsepower = 마력  
- weight = 무게  
- acceleration = 테이블당 사람 수  
- model_year = 생산년도  
- origin = 생산국  
- name = 자동차 모델명

In [ ]:
mpg = sns.load_dataset('mpg')
mpg.head()

    mpg  cylinders  displacement  ...  model_year  origin                       name
0  18.0          8         307.0  ...          70     usa  chevrolet chevelle malibu
1  15.0          8         350.0  ...          70     usa          buick skylark 320
2  18.0          8         318.0  ...          70     usa         plymouth satellite
3  16.0          8         304.0  ...          70     usa              amc rebel sst
4  17.0          8         302.0  ...          70     usa                ford torino

[5 rows x 9 columns]

> 😅😅 위 데이터셋들은 target 열이 따로 정해져 있지 않습니다 💦   
**'여러분(데이터 사이언티스트🤓)이 정하기 나름대로'**  
🧡유의미한 데이터가 될 수도, 💔무의미한 데이터가 될 수도 있습니다!



---

In [ ]:
iris = sns.load_dataset('iris')
iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [ ]:
# 나누기 
species = iris['species'] # target
iris_input = iris.drop('species', axis=1) # 'species'만 따로 drop해서 iris_input에 저장합니다.

print(species)
print(iris_input)

0         setosa
1         setosa
2         setosa
3         setosa
4         setosa
         ...
145    virginica
146    virginica
147    virginica
148    virginica
149    virginica
Name: species, Length: 150, dtype: object
     sepal_length  sepal_width  petal_length  petal_width
0             5.1          3.5           1.4          0.2
1             4.9          3.0           1.4          0.2
2             4.7          3.2           1.3          0.2
3             4.6          3.1           1.5          0.2
4             5.0          3.6           1.4          0.2
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[150 rows x 4 columns]

<img src='https://ifh.cc/g/IGvnbQ.jpg' border='0'>

### 📌 **Step2. 데이터 인코딩 (Encoding)**

앞서 배운대로, 데이터는 크게 **2가지 형태**로 나뉩니다. **→ 수치형(Numerical) 또는 범주형(Categorical)**

우리가 만들 머신러닝 모델들은 **범주형(Categorical) 데이터를 입력값으로 활용할 수 없습니다. 🙅‍♀️🙅‍♂️**

🌟 따라서 '남자', '빨강', '사과' 등의 범주형 데이터(Categorical data)를 수치형 데이터(Numerical data)으로 변환해주는 **전처리 작업(preprocessing)**이 선행되어야 합니다. 🌟

<img src='https://ifh.cc/g/eEzfDa.jpg' border='0'>



---

💁‍♀️ 데이터 **인코딩(또는 전처리) 방법**은 **여러가지**가 있습니다.

</br>

<img src='https://ifh.cc/g/d9vP9u.png' width="480px;" height="240px;" border='0'>



---

#### 1️⃣ **Pandas** 의 **map** 함수 이용하기 🔨

</br>

데이터 인코딩(또는 전처리) 방법의 첫 번째로, **map 함수를 이용하는 방법**입니다.  

`map` 함수를 이용하면 pandas 데이터프레임 안에 있는 데이터를 python dictionary 형태에 맞게 변환해줍니다. 

tips_dataset을 통해 한 번 알아보겠습니다.

<img src='https://ifh.cc/g/EF9OLl.png' width="400px;" border='0'>

In [ ]:
tips = sns.load_dataset('tips')
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [ ]:
import pandas as pd
# categorical data인 'sex(Female 또는 Male)'를 map 함수를 사용하여 인코딩(전처리) 해볼까요?
tips['sex'] = tips['sex'].map({'Male':0, "Female":1})
tips.head()

   total_bill   tip sex smoker  day    time  size
0       16.99  1.01   1     No  Sun  Dinner     2
1       10.34  1.66   0     No  Sun  Dinner     3
2       21.01  3.50   0     No  Sun  Dinner     3
3       23.68  3.31   0     No  Sun  Dinner     2
4       24.59  3.61   1     No  Sun  Dinner     4

</br>

<img src='https://ifh.cc/g/B2hVe7.png' width="330px;" height="70px;" border='0'>

> 🔍 tips_dataset 내 categorical data 중, 'smoker'도 map 함수를 사용하여 numerical data로 변환해보세요!

In [ ]:
tips['smoker'].unique()

['No', 'Yes']
Categories (2, object): ['No', 'Yes']

In [ ]:
## 여기에서!
tips['smoker'] = tips['smoker'].map({'No':0, "Yes":1})
tips.head()

   total_bill   tip sex smoker  day    time  size
0       16.99  1.01   1      0  Sun  Dinner     2
1       10.34  1.66   0      0  Sun  Dinner     3
2       21.01  3.50   0      0  Sun  Dinner     3
3       23.68  3.31   0      0  Sun  Dinner     2
4       24.59  3.61   1      0  Sun  Dinner     4




---

#####❗ **map함수의 한계** ❗



앞서 Pandas의 map 함수를 이용해서 범주형 데이터(Categorical data)를 수치형 데이터(Numerical data)로 인코딩 해주었습니다.

하지만, **하나의 feature 내 카테고리 개수가 너무 많은 경우는 어떨까요?**  
아래 mpg_dataset의 'name' 항목처럼요. (*자동차 모델명)

<img src='https://ifh.cc/g/hqgTUr.png' width="750px;" border='0'>

In [ ]:
mpg.head(4)

    mpg  cylinders  displacement  ...  model_year  origin                       name
0  18.0          8         307.0  ...          70     usa  chevrolet chevelle malibu
1  15.0          8         350.0  ...          70     usa          buick skylark 320
2  18.0          8         318.0  ...          70     usa         plymouth satellite
3  16.0          8         304.0  ...          70     usa              amc rebel sst

[4 rows x 9 columns]

In [ ]:
mpg.name

0      chevrolet chevelle malibu
1              buick skylark 320
2             plymouth satellite
3                  amc rebel sst
4                    ford torino
                 ...
393              ford mustang gl
394                    vw pickup
395                dodge rampage
396                  ford ranger
397                   chevy s-10
Name: name, Length: 398, dtype: object

In [ ]:
print(mpg.name.nunique())

305

In [ ]:
print(mpg['name'].unique())

['chevrolet chevelle malibu' 'buick skylark 320' 'plymouth satellite'
 'amc rebel sst' 'ford torino' 'ford galaxie 500' 'chevrolet impala'
 'plymouth fury iii' 'pontiac catalina' 'amc ambassador dpl'
 'dodge challenger se' "plymouth 'cuda 340" 'chevrolet monte carlo'
 'buick estate wagon (sw)' 'toyota corona mark ii' 'plymouth duster'
 'amc hornet' 'ford maverick' 'datsun pl510'
 'volkswagen 1131 deluxe sedan' 'peugeot 504' 'audi 100 ls' 'saab 99e'
 'bmw 2002' 'amc gremlin' 'ford f250' 'chevy c20' 'dodge d200' 'hi 1200d'
 'chevrolet vega 2300' 'toyota corona' 'ford pinto'
 'plymouth satellite custom' 'ford torino 500' 'amc matador'
 'pontiac catalina brougham' 'dodge monaco (sw)'
 'ford country squire (sw)' 'pontiac safari (sw)'
 'amc hornet sportabout (sw)' 'chevrolet vega (sw)' 'pontiac firebird'
 'ford mustang' 'mercury capri 2000' 'opel 1900' 'peugeot 304' 'fiat 124b'
 'toyota corolla 1200' 'datsun 1200' 'volkswagen model 111'
 'plymouth cricket' 'toyota corona hardtop' 'dodge colt hardtop'
 'volkswagen type 3' 'chevrolet vega' 'ford pinto runabout'
 'amc ambassador sst' 'mercury marquis' 'buick lesabre custom'
 'oldsmobile delta 88 royale' 'chrysler newport royal' 'mazda rx2 coupe'
 'amc matador (sw)' 'chevrolet chevelle concours (sw)'
 'ford gran torino (sw)' 'plymouth satellite custom (sw)'
 'volvo 145e (sw)' 'volkswagen 411 (sw)' 'peugeot 504 (sw)'
 'renault 12 (sw)' 'ford pinto (sw)' 'datsun 510 (sw)'
 'toyouta corona mark ii (sw)' 'dodge colt (sw)'
 'toyota corolla 1600 (sw)' 'buick century 350' 'chevrolet malibu'
 'ford gran torino' 'dodge coronet custom' 'mercury marquis brougham'
 'chevrolet caprice classic' 'ford ltd' 'plymouth fury gran sedan'
 'chrysler new yorker brougham' 'buick electra 225 custom'
 'amc ambassador brougham' 'plymouth valiant' 'chevrolet nova custom'
 'volkswagen super beetle' 'ford country' 'plymouth custom suburb'
 'oldsmobile vista cruiser' 'toyota carina' 'datsun 610' 'maxda rx3'
 'mercury capri v6' 'fiat 124 sport coupe' 'chevrolet monte carlo s'
 'pontiac grand prix' 'fiat 128' 'opel manta' 'audi 100ls' 'volvo 144ea'
 'dodge dart custom' 'saab 99le' 'toyota mark ii' 'oldsmobile omega'
 'chevrolet nova' 'datsun b210' 'chevrolet chevelle malibu classic'
 'plymouth satellite sebring' 'buick century luxus (sw)'
 'dodge coronet custom (sw)' 'audi fox' 'volkswagen dasher' 'datsun 710'
 'dodge colt' 'fiat 124 tc' 'honda civic' 'subaru' 'fiat x1.9'
 'plymouth valiant custom' 'mercury monarch' 'chevrolet bel air'
 'plymouth grand fury' 'buick century' 'chevroelt chevelle malibu'
 'plymouth fury' 'buick skyhawk' 'chevrolet monza 2+2' 'ford mustang ii'
 'toyota corolla' 'pontiac astro' 'volkswagen rabbit' 'amc pacer'
 'volvo 244dl' 'honda civic cvcc' 'fiat 131' 'capri ii' 'renault 12tl'
 'dodge coronet brougham' 'chevrolet chevette' 'chevrolet woody'
 'vw rabbit' 'dodge aspen se' 'ford granada ghia' 'pontiac ventura sj'
 'amc pacer d/l' 'datsun b-210' 'volvo 245' 'plymouth volare premier v8'
 'mercedes-benz 280s' 'cadillac seville' 'chevy c10' 'ford f108'
 'dodge d100' 'honda accord cvcc' 'buick opel isuzu deluxe'
 'renault 5 gtl' 'plymouth arrow gs' 'datsun f-10 hatchback'
 'oldsmobile cutlass supreme' 'dodge monaco brougham'
 'mercury cougar brougham' 'chevrolet concours' 'buick skylark'
 'plymouth volare custom' 'ford granada' 'pontiac grand prix lj'
 'chevrolet monte carlo landau' 'chrysler cordoba' 'ford thunderbird'
 'volkswagen rabbit custom' 'pontiac sunbird coupe'
 'toyota corolla liftback' 'ford mustang ii 2+2' 'dodge colt m/m'
 'subaru dl' 'datsun 810' 'bmw 320i' 'mazda rx-4'
 'volkswagen rabbit custom diesel' 'ford fiesta' 'mazda glc deluxe'
 'datsun b210 gx' 'oldsmobile cutlass salon brougham' 'dodge diplomat'
 'mercury monarch ghia' 'pontiac phoenix lj' 'ford fairmont (auto)'
 'ford fairmont (man)' 'plymouth volare' 'amc concord'
 'buick century special' 'mercury zephyr' 'dodge aspen' 'amc concord d/l'
 'buick regal sport coupe (turbo)' 'ford futura' 'dodge magnum xe'
 'datsun 510' 'dodge omni' 'toyota celica gt liftback' 'plymouth sapporo'
 'oldsmobile starfire sx' 'datsun 200-sx' 'audi 5000' 'volvo 264gl'
 'saab 99gle' 'peugeot 604sl' 'volkswagen scirocco' 'honda accord lx'
 'pontiac lemans v6' 'mercury zephyr 6' 'ford fairmont 4'
 'amc concord dl 6' 'dodge aspen 6' 'ford ltd landau'
 'mercury grand marquis' 'dodge st. regis' 'chevrolet malibu classic (sw)'
 'chrysler lebaron town @ country (sw)' 'vw rabbit custom'
 'maxda glc deluxe' 'dodge colt hatchback custom' 'amc spirit dl'
 'mercedes benz 300d' 'cadillac eldorado' 'plymouth horizon'
 'plymouth horizon tc3' 'datsun 210' 'fiat strada custom'
 'buick skylark limited' 'chevrolet citation' 'oldsmobile omega brougham'
 'pontiac phoenix' 'toyota corolla tercel' 'datsun 310' 'ford fairmont'
 'audi 4000' 'toyota corona liftback' 'mazda 626' 'datsun 510 hatchback'
 'mazda glc' 'vw rabbit c (diesel)' 'vw dasher (diesel)'
 'audi 5000s (diesel)' 'mercedes-benz 240d' 'honda civic 1500 gl'
 'renault lecar deluxe' 'vokswagen rabbit' 'datsun 280-zx' 'mazda rx-7 gs'
 'triumph tr7 coupe' 'ford mustang cobra' 'honda accord'
 'plymouth reliant' 'dodge aries wagon (sw)' 'toyota starlet'
 'plymouth champ' 'honda civic 1300' 'datsun 210 mpg' 'toyota tercel'
 'mazda glc 4' 'plymouth horizon 4' 'ford escort 4w' 'ford escort 2h'
 'volkswagen jetta' 'renault 18i' 'honda prelude' 'datsun 200sx'
 'peugeot 505s turbo diesel' 'volvo diesel' 'toyota cressida'
 'datsun 810 maxima' 'oldsmobile cutlass ls' 'ford granada gl'
 'chrysler lebaron salon' 'chevrolet cavalier' 'chevrolet cavalier wagon'
 'chevrolet cavalier 2-door' 'pontiac j2000 se hatchback' 'dodge aries se'
 'ford fairmont futura' 'amc concord dl' 'volkswagen rabbit l'
 'mazda glc custom l' 'mazda glc custom' 'plymouth horizon miser'
 'mercury lynx l' 'nissan stanza xe' 'honda civic (auto)' 'datsun 310 gx'
 'buick century limited' 'oldsmobile cutlass ciera (diesel)'
 'chrysler lebaron medallion' 'ford granada l' 'toyota celica gt'
 'dodge charger 2.2' 'chevrolet camaro' 'ford mustang gl' 'vw pickup'
 'dodge rampage' 'ford ranger' 'chevy s-10']

이거 정말 map 함수로 일일이 인코딩... 가능할까요?😖😖

</br>

---

</br>

#### 2️⃣ **Scikit-learn** 의 패키지 이용하기 🔧

💡 이런 경우 두 번째 방법인 **scikit-learn (sklearn)**의 **LabelEncoder** 를 활용하면 됩니다!

<img src='https://ifh.cc/g/zUCZ29.png' width="620px;"  border='0'>

iris_dataset에서 categorical data인 'species'의 인코딩을 통해 알아볼까요?

```
🙂 여기서 잠깐! iris_dataset 기억나시나요?  
👉 petal(꽃잎)과 sepal(꽃받침)의 길이/너비 data를 바탕으로 어떤 species(종)인지 예측
```



>  LabelEncoder를 쓰기 위해, 먼저 전처리(preprocessing) 패키지를 불러옵니다.

```
from sklearn import preprocessing
```

In [ ]:
import seaborn as sns # from seaborn import relplot
# import sklearn
from sklearn import preprocessing   #LabelEncoder()를 쓰기위해 먼저 불러와야 하는 패키지
# sklearn 안에 있는 perprocessing 기능을 불러오는 것(원활한 런타임 작동을 위해 필요한 기능만 불러온다.)

iris = sns.load_dataset('iris')
print(iris.head())  # 원본 확인

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

> 🔓**인코딩 하기!**
- `preprocessing.LabelEncoder()`
- `le.fit_transform(바꾸려는 데이터열)`

><img src='https://ifh.cc/g/Y3bhX0.png'  width="405px;" height="140px;" border='0'>

In [ ]:
le = preprocessing.LabelEncoder()

In [ ]:
iris['species'] = le.fit_transform(iris['species'])   # categorical 데이터를 간편하게 numerical 데이터로 바꿔줍니다
print(iris['species'].unique()) # 각각의 범주형 데이터(categorical data)가 각각 어떤 수치형 데이터(numerical data)로 인코딩(encoding)됬는지 'unique'를 써서 확인
iris.head()    # 데이터가 어떻게 바뀌었는지 확인

[0 1 2]

   sepal_length  sepal_width  petal_length  petal_width  species
0           5.1          3.5           1.4          0.2        0
1           4.9          3.0           1.4          0.2        0
2           4.7          3.2           1.3          0.2        0
3           4.6          3.1           1.5          0.2        0
4           5.0          3.6           1.4          0.2        0

### 👀 수치형(numerical)으로 인코딩한 데이터를 범주형(categorical)데이터로 **다시 되돌리고 싶다면?**

In [ ]:
# 반대로, numerical 데이터를 catergorical 데이터로 되돌릴 수도 있습니다
iris['species'] = le.inverse_transform(iris['species'])
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [ ]:
le.transform(['setosa', 'versicolor', 'virginica']) # 변수가 어떻게 numerical 데이터로 표기되었는지.

array([0, 1, 2])



---

#####❗ **Label encoder의 한계** ❗


위와 같은 인코딩(전처리) 방법 두 개는 간단하고 직관적이지만, 한 가지 문제가 있습니다 ⛔

> **[ 매우 싫다 -> 1, 보통이다 -> 3 , 매우 좋다 -> 5점 ]** 처럼  
 "ordinal한 데이터"에는 적합하지만, 🙆‍♀️ (*순서 또는 등급 有)

> **[ 빨강 -> 1, 파랑 -> 2, 초록 -> 3 ]** 처럼  
 "nominal한 데이터"에는 적합하지 않습니다. 🙅‍♀️ (*순서 또는 등급 無)

> 빨강, 파랑, 초록이라는 색깔들 사이에는 어떠한 순서나 등급도 없지만,  
위의 방법들로 변환하면 초록값이 가장 크다던지,  
"(초록값) - (파랑값) = (빨강값)" 등의 **관계**가 생기기 때문입니다.  

> 머신러닝 모델은 변환된 숫자를 바탕으로 학습하기 때문에, 잘못하면 위의 관계(특성)를 학습해 버립니다 😭😭  
이는 논리적으로 문제가 있을 뿐만 아니라, 실제 모델의 성능도 잘 안나오게 됩니다.



---

</br>

#### 3️⃣ **pandas**의 **get_dummies**  이용하기 🔩

</br>


**💡 따라서 nominal한 데이터 변환을 위해서는**, 숫자이기는 하지만 **서로 '관계없는' 숫자로 변환**해 주어야합니다.

<img src='https://ifh.cc/g/qlK9eZ.png' width="680px;"  border='0'>

<img src='https://ifh.cc/g/r5eLEF.png' border='0'>


---

</br>

👉 그럼 mpg_dataset에서 'origin(자동차 제조국)' 열을 통해 자세히 알아보겠습니다.

In [ ]:
mpg.origin.unique() 
# mpg_dataset에서 타겟열('origin')의 카테고리 종류(중복되지 않는 값의 개수) 확인하기
# mpg['origin'].unique() 와 같은 기능!

array(['usa', 'japan', 'europe'], dtype=object)

In [ ]:
mpg_origin_dummies = pd.get_dummies(mpg['origin'],prefix='Origin')  
# origin에 속한 카테고리(원산지)별로 새로운 comlumn(열)이 생김
mpg_origin_dummies

     Origin_europe  Origin_japan  Origin_usa
0                0             0           1
1                0             0           1
2                0             0           1
3                0             0           1
4                0             0           1
..             ...           ...         ...
393              0             0           1
394              1             0           0
395              0             0           1
396              0             0           1
397              0             0           1

[398 rows x 3 columns]

🛠 전처리(변환) 후 원래 데이터와 합쳐주기 🛠

<img src='https://ifh.cc/g/ugmEeQ.png' width="800px;" border='0'>


> - `pd.concat()`

In [ ]:
mpg_dummies = pd.concat([mpg, mpg_origin_dummies], axis=1)
mpg_dummies

      mpg  cylinders  displacement  ...  Origin_europe  Origin_japan  Origin_usa
0    18.0          8         307.0  ...              0             0           1
1    15.0          8         350.0  ...              0             0           1
2    18.0          8         318.0  ...              0             0           1
3    16.0          8         304.0  ...              0             0           1
4    17.0          8         302.0  ...              0             0           1
..    ...        ...           ...  ...            ...           ...         ...
393  27.0          4         140.0  ...              0             0           1
394  44.0          4          97.0  ...              1             0           0
395  32.0          4         135.0  ...              0             0           1
396  28.0          4         120.0  ...              0             0           1
397  31.0          4         119.0  ...              0             0           1

[398 rows x 12 columns]

🛠 Categorical 데이터 삭제(drop)하기 🛠

<img src='https://ifh.cc/g/avmjhg.png'  border='0'>

In [ ]:
mpg_dummies.drop('origin', axis=1, inplace=True) # 'origin'데이터를 삭제(drop)
mpg_dummies

      mpg  cylinders  displacement  ...  Origin_europe  Origin_japan  Origin_usa
0    18.0          8         307.0  ...              0             0           1
1    15.0          8         350.0  ...              0             0           1
2    18.0          8         318.0  ...              0             0           1
3    16.0          8         304.0  ...              0             0           1
4    17.0          8         302.0  ...              0             0           1
..    ...        ...           ...  ...            ...           ...         ...
393  27.0          4         140.0  ...              0             0           1
394  44.0          4          97.0  ...              1             0           0
395  32.0          4         135.0  ...              0             0           1
396  28.0          4         120.0  ...              0             0           1
397  31.0          4         119.0  ...              0             0           1

[398 rows x 11 columns]



---

**👌👌👌 정리 해볼까요? 👌👌👌**

</br>  

<img src='https://ifh.cc/g/COLTOP.png'  width="575px;" height="400px;" border='0'>

<img src='https://ifh.cc/g/IGvnbQ.jpg' border='0'>

### 📌 **Step3. Test / Train data split**

</br>

**Train 데이터셋과 Test 데이터셋 분리**에 대한 개념을 이해하기 위해 대학 수능 시험 공부를 예시로 들어보겠습니다. 

</br>

수험생들은 당해 수능에 대비하기 위해 그 전년도까지의 수능 기출문제를 공부합니다 📝📝  

만약 '19년도 기출문제만 반복해서 공부한 후 **똑같은** 문제를 풀었더니 100점이 나왔다고 해서, 그게 정말 내 '수능 성적'일까요?  
진짜 실력이라기 보다는 단순히 답이 기억나서 점수가 높게 나온 것이겠죠? ❌🚫⛔❗  

정확한 내 실력을 평가하기 위해서는,  
**한 번도 보지못한** 기출문제로 평가를 해야할 것입니다. 

</br>

🧐기계학습도 마찬가지로! 모델 성능을 정확한 평가하려면,  
공부(Train)에는 사용되지 않고 **오로지 평가에만 사용되는 TEST 데이터가 필요**합니다.  

학습에 사용된 데이터로 평가를 하게 된다면,  
기계학습 모델이 수능문제를 푸는 지식과 요령을 제대로 학습한 것인지,  
아니면 단순히 문제의 답을 외워서 점수가 높은 것인지 분간이 되지 않기 때문입니다.  

</br>

>⛹️‍♀️ **학습**을 위한 데이터 집합 : **Train Set**  
🥇 성능 **검증**을 위한 데이터 집합 : **Test Set**  

</br>

<img src='https://ifh.cc/g/6Y6V3r.jpg' border='0'>

</br>

👍 Kaggle의 데이터셋 대부분은 Train set과 Test set이 분리되어 제공됩니다. 
(*titanic_dataset도 마찬가지!) 

</br>

![대체 텍스트](https://i.ibb.co/GJ8rrKW/Screen-Shot-2020-03-05-at-6-25-07-PM.png)



---

####**🤔 만약 Test set이 제공되지 않는다면?**

👉 하나의 Data set을 Train set과 Test set으로 나눠줘야 합니다.

> Scikit-learn 의 함수를 사용하여 Train set을 나눠서 사용할 수 있습니다.  
> 🔍 tips dataset으로 연습

In [ ]:
tips  # 원본 데이터 확인해보기

     total_bill   tip sex smoker   day    time  size
0         16.99  1.01   1      0   Sun  Dinner     2
1         10.34  1.66   0      0   Sun  Dinner     3
2         21.01  3.50   0      0   Sun  Dinner     3
3         23.68  3.31   0      0   Sun  Dinner     2
4         24.59  3.61   1      0   Sun  Dinner     4
..          ...   ...  ..    ...   ...     ...   ...
239       29.03  5.92   0      0   Sat  Dinner     3
240       27.18  2.00   1      1   Sat  Dinner     2
241       22.67  2.00   0      1   Sat  Dinner     2
242       17.82  1.75   0      0   Sat  Dinner     2
243       18.78  3.00   1      0  Thur  Dinner     2

[244 rows x 7 columns]

In [ ]:
tips['total_bill']    # y값을 의미하는 label 찾기

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

</br>

#### 🔍 Scikit-learn 패키지를 사용하여 Train / Test 셋 분리하기
- `train_test_split(arrays, test_size, train_size, random_state, shuffle, stratify)`의 매개변수(parameter)
```
arrays : 분할시킬 데이터를 입력 (Python list, Numpy array, Pandas dataframe 등..)
test_size : 테스트 데이터셋의 비율(float)이나 갯수(int) (default = 0.25)
train_size : 학습 데이터셋의 비율(float)이나 갯수(int) (default = test_size의 나머지)
random_state : 데이터 분할시 셔플이 이루어지는데 이를 기억하기 위한 임의의 시드값 (int나 RandomState로 입력)
shuffle : 셔플여부설정 (default = True)
stratify : 지정한 Data의 비율을 유지한다. 예를 들어, Label Set인 Y가 25%의 0과 75%의 1로 이루어진 Binary Set일 때,
            stratify=Y로 설정하면 나누어진 데이터셋들도 0과 1을 각각 25%, 75%로 유지한 채 분할된다.
```

- 예제

```
import numpy as np
from sklearn.model_selection import train_test_split 

X = [[0,1],[2,3],[4,5],[6,7],[8,9]]
Y = [0,1,2,3,4]

# 데이터(X)만 넣었을 경우
X_train, X_test = train_test_split(X, test_size=0.2, random_state=123)
# X_train : [[0,1],[6,7],[8,9],[2,3]]
# X_test : [[4,5]]

# 데이터(X)와 레이블(Y)을 넣었을 경우
X_train, X_test, Y_train, Y_test = train_test_split(X, Y, test_size=0.33, random_state=321)
# X_train : [[4,5],[0,1],[6,7]]
# Y_train : [2,0,3]
# X_test : [[2,3],[8,9]]
# Y_test : [1,4]
```

⭐괄호() 안에 들어가는 인자 중 x,y 변수의 순서에 주의하세요⭐

In [ ]:
from sklearn.model_selection import train_test_split

In [ ]:
# 우선 나눌 input array x 와 output array y 를 정의합니다

x = tips.drop('total_bill',axis=1)
y = tips['total_bill']
xTrain, xTest, yTrain, yTest = train_test_split(x,y, test_size=0.2, random_state=1, shuffle=True) # 20%만 잘라서 test 로 만듭니다.

In [ ]:
tips.shape

(244, 7)

In [ ]:
xTrain.head(5)    # 훈련셋 잘 분리 되었는지 항상 체크해보기!! 셀 단위 실행의 장점입니다 ^0^

      tip sex smoker  day    time  size
0    1.01   1      0  Sun  Dinner     2
154  2.00   0      0  Sun  Dinner     4
167  4.50   0      0  Sun  Dinner     4
110  3.00   0      0  Sat  Dinner     2
225  2.50   1      1  Fri   Lunch     2

In [ ]:
xTest.head(5)    # 테스트셋 확인해보기

      tip sex smoker   day    time  size
67   1.00   1      1   Sat  Dinner     1
243  3.00   1      0  Thur  Dinner     2
206  3.41   0      1   Sat  Dinner     3
122  2.50   0      0  Thur   Lunch     2
89   3.00   0      0  Thur   Lunch     2



---

### **교차검증법(cross validation)**

#### Cross Validation 교차검증법 이용하기 

> 🧨 데이터 수가 적을 때 발생하는 문제  
   - 쪼갠 검증 데이터 수가 적기 때문에 검증 성능의 신뢰도가 떨어짐
   - 검증 데이터셋 비율을 높힌다면, 학습 데이터셋 크기가 줄어들어 학습이 되지 않음  

이 경우에 **Cross Validation** 이라는 교차검증법을 이용합니다.  
보통 K-fold Cross Validation (k 겹 Cross Vlidatino) 을 많이 사용합니다. 


---


 K-fold Cross Validation
>1) 데이터를 K 개의 집합으로 나눠,  
2) 매번 한개의 집합을 Test 로 쓰고, 나머지를 학습에 사용합니다  
3) 이때 나온 K 개의 정확도 지표를 평균을 내서 최종 평가지표로 사용합니다   
✔ 주로 K = 5 를 많이 사용합니다 (오겹살 🐷)  
✔ K = 10 도 종종 사용합니다 (그러나 K  가 10 이 넘어갈 정도면, 데이터셋이 split 해도될정도로 충분히 크다고 봄)  

<img src='https://ifh.cc/g/TlQkBR.jpg' border='0'>

In [ ]:
iris = sns.load_dataset('iris')   # 데이터셋 불러오기
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [ ]:
x = iris.drop('species', axis=1)
y = iris['species'].map({'setosa':1, 'versicolor':2, 'virginica':3})

print(x)
print(y)

     sepal_length  sepal_width  petal_length  petal_width
0             5.1          3.5           1.4          0.2
1             4.9          3.0           1.4          0.2
2             4.7          3.2           1.3          0.2
3             4.6          3.1           1.5          0.2
4             5.0          3.6           1.4          0.2
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[150 rows x 4 columns]
0      1
1      1
2      1
3      1
4      1
      ..
145    3
146    3
147    3
148    3
149    3
Name: species, Length: 150, dtype: int64

실제로 cross validation을 사용해서 머신러닝을 해보도록 하겠습니다!!
> - `cross_val_score(모델,x,y,cv=k개)`

In [ ]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import cross_val_score

model = LogisticRegression(max_iter=1000)     # 모델은 다음 시간에 설명합니다. 넘어가기!
scores = cross_val_score(model,x,y,cv=5)     # cv 는 cross validation의 약자입니다

print(scores)
print(scores.mean())                         # 정확도까지만 보고 넘어가기!

[0.96666667 1.         0.93333333 0.96666667 1.        ]
0.9733333333333334

####**✍ score 는 무슨 기준으로 판별하는 건가요?**

</br>  

score 은 scikitlearn 의 metrics.accuracy_score 에 의해서 계산됩니다.

<img src = "https://1.bp.blogspot.com/-LKcvhNPrpuo/XqaLxt7AIvI/AAAAAAAAAUI/6dADzp9Q-9cNWExBXEW4LQj4aWYiRFrHQCLcBGAsYHQ/s1600/%25E1%2584%2589%25E1%2585%25B3%25E1%2584%258F%25E1%2585%25B3%25E1%2584%2585%25E1%2585%25B5%25E1%2586%25AB%25E1%2584%2589%25E1%2585%25A3%25E1%2586%25BA%2B2020-04-27%2B%25E1%2584%258B%25E1%2585%25A9%25E1%2584%2592%25E1%2585%25AE%2B4.36.25.png" width = "800">

</br>  

정확도를 기준으로 계산되며,   
예측값 (pred) 과 실제값 (y_true) 이 정확하게 일치할 때 1 값을 가지고,   
반만 맞을 경우 0.5와 같은 식으로 확률로 반환됩니다.

### **2-② 추가 실습예제**

#### 숙제 : test셋과 train셋의 분리 연습
다음 시간에는 'titanic dataset'을 심도있게 다룰 예정입니다.  
본격적으로 시작하기 전!! 🐬데이터 다이빙🐬 여러분이 직접 test셋과 train셋을 분리해보도록 하겠습니다.
> - 타이타닉 데이터셋을 seaborn이 아닌, 본인 계정에서 gdrive 경로를 통해 불러오세요.
- y라는 변수를 만들고 생존에 대한 열을 선언하세요.
- x라는 변수에 label을 제외한 열들을 선언하세요.
- z라는 변수에 'age'열을 담은 뒤, 비어있는 값이 있는 행을 제거하고, 배운 내용을 토대로 다양하게 해당 열을 시각화해보세요.

In [ ]:
# 여기에!! 파이팅!!!!

titanic = sns.load_dataset('titanic')
titanic.head(3)

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True

[3 rows x 15 columns]

In [ ]:
titanic_age = titanic['age']

In [ ]:
titanic_age.isna().sum()

177

In [ ]:
titanic_age.dropna(axis=0)

In [ ]:
x = titanic
y = titanic['survived']

xTrain, xTest, yTrain, yTest = train_test_split(x,y, test_size=0.2)

In [ ]:
xTrain.head(5)

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
145         0       2    male  19.0  ...   NaN  Southampton     no  False
374         0       3  female   3.0  ...   NaN  Southampton     no  False
738         0       3    male   NaN  ...   NaN  Southampton     no   True
715         0       3    male  19.0  ...     F  Southampton     no   True
630         1       1    male  80.0  ...     A  Southampton    yes   True

[5 rows x 15 columns]

<img src='https://ifh.cc/g/IGvnbQ.jpg' border='0'>

# 🌈 끝 🌈

<img src='https://ifh.cc/g/aT2woP.png' width = "500" border='0'>


 이렇게 **데이터 시각화와 데이터 전처리**에 대해서 배웠습니다  
여러분의 표정이 보이는 듯도 하는데요 🙉🙈🤯🤮  

특히 오늘 배운 전처리를 통해서 다음주에 본격적인 '머신러닝'을 돌려볼 것입니다.

<br/>

다음 수업엔 **재밌는 실습을 통해서** 오늘 배운 내용을 복습하고 또 머신러닝 모델에 대해서 배워보도록 하겠습니다.

많이 기대해주세요~😍😍😍

<img src='https://ifh.cc/g/VfqO4P.jpg' border='0'>

</br>